PANDAS 21

#21: Agregasi pada pandas data frame dengan agg()

In [1]:
import pandas as pd

print(pd.__version__)

2.3.3

In [ ]:
from sklearn import datasets

iris = datasets.load_iris()

df = pd.DataFrame(
    data = iris.data,
    columns = iris.feature_names
)

df['target'] = iris.target
df.head()

,sepal length (cm),sepal width (cm),petal length (cm),petal width (cm),target
0,5.1,3.5,1.4,0.2,0
1,4.9,3.0,1.4,0.2,0
2,4.7,3.2,1.3,0.2,0
3,4.6,3.1,1.5,0.2,0
4,5.0,3.6,1.4,0.2,0

In [7]:
df = df.rename(columns={
    'sepal length (cm)': 'SepalLengthCm',
    'sepal width (cm)': 'SepalWidthCm',
    'petal length (cm)': 'PetalLengthCm',
    'petal width (cm)': 'PetalWidthCm'
})

df['Species'] = df['target'].map({
    0: 'Iris-setosa',
    1: 'Iris-versicolor',
    2: 'Iris-virginica'
})

Mengenal groupby() dan fungsi agregasi:

In [8]:
df.groupby('Species')['PetalLengthCm'].count().to_frame()

                 PetalLengthCm
Species
Iris-setosa                 50
Iris-versicolor             50
Iris-virginica              50

In [9]:
df.groupby('Species')['PetalLengthCm'].mean().to_frame()

                 PetalLengthCm
Species
Iris-setosa              1.462
Iris-versicolor          4.260
Iris-virginica           5.552

In [10]:
df.groupby('Species')['PetalLengthCm'].median().to_frame()

                 PetalLengthCm
Species
Iris-setosa               1.50
Iris-versicolor           4.35
Iris-virginica            5.55

Agregasi dengan agg():

In [11]:
df.groupby('Species')['PetalLengthCm'].agg(['count', 'mean', 'median'])

                 count   mean  median
Species
Iris-setosa         50  1.462    1.50
Iris-versicolor     50  4.260    4.35
Iris-virginica      50  5.552    5.55

Agregasi dengan describe():

In [12]:
df.groupby('Species')['PetalLengthCm'].describe()

                 count   mean       std  min  25%   50%    75%  max
Species
Iris-setosa       50.0  1.462  0.173664  1.0  1.4  1.50  1.575  1.9
Iris-versicolor   50.0  4.260  0.469911  3.0  4.0  4.35  4.600  5.1
Iris-virginica    50.0  5.552  0.551895  4.5  5.1  5.55  5.875  6.9

PANDAS 22

#22: Memantau penggunaan memory pada data frame

In [14]:
df = pd.read_csv('titanicfull.csv')
df.head()

,Pclass,Survival status,full Name,Sex,Age,Sib SP,Parch,Ticket,Fare,Cabin,Embarked
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S
3,1,1,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1,2,113781,151.5500,C22 C26,S
4,1,1,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,151.5500,C22 C26,S

Memantau penggunaan memory suatu data frame:

In [22]:
df.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 11 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Pclass           5 non-null      int64
 1   Survival status  5 non-null      int64
 2   full Name        5 non-null      object
 3   Sex              5 non-null      object
 4   Age              5 non-null      float64
 5   Sib SP           5 non-null      int64
 6   Parch            5 non-null      int64
 7   Ticket           5 non-null      int64
 8   Fare             5 non-null      float64
 9   Cabin            5 non-null      object
 10  Embarked         5 non-null      object
dtypes: float64(2), int64(5), object(4)
memory usage: 1.6 KB

Memantau penggunaan memory untuk setiap kolom dari suatu data frame:

In [23]:
df.memory_usage(deep=True)

Index              132
Pclass              40
Survival status     40
full Name          415
Sex                271
Age                 40
Sib SP              40
Parch               40
Ticket              40
Fare                40
Cabin              275
Embarked           250
dtype: int64

PANDAS 23

#23: Seleksi baris pada data frame dengan query

In [24]:
d = {'kolom_satu':[1, 2, 3, 4, 5], 
     'kolom dua':[10, 20, 30, 40, 50]}
df = pd.DataFrame(d)
df

   kolom_satu  kolom dua
0           1         10
1           2         20
2           3         30
3           4         40
4           5         50

Seleksi baris dengan query():

In [25]:
df.query('kolom_satu > 2')

   kolom_satu  kolom dua
2           3         30
3           4         40
4           5         50

In [26]:
df.query('`kolom dua` > 30')

   kolom_satu  kolom dua
3           4         40
4           5         50

PANDAS 24

#24: UTC dan konversi zona waktu pada python pandas

In [27]:
s = pd.Series(range(1591683521, 1592201921, 3600))
s = pd.to_datetime(s, unit='s')
s.head()

0   2020-06-09 06:18:41
1   2020-06-09 07:18:41
2   2020-06-09 08:18:41
3   2020-06-09 09:18:41
4   2020-06-09 10:18:41
dtype: datetime64[ns]

Pengaturan zona waktu (time zone):

In [28]:
s = s.dt.tz_localize('UTC')
s.head()

0   2020-06-09 06:18:41+00:00
1   2020-06-09 07:18:41+00:00
2   2020-06-09 08:18:41+00:00
3   2020-06-09 09:18:41+00:00
4   2020-06-09 10:18:41+00:00
dtype: datetime64[ns, UTC]

In [29]:
s = s.dt.tz_convert('Asia/Jakarta')
s.head()

0   2020-06-09 13:18:41+07:00
1   2020-06-09 14:18:41+07:00
2   2020-06-09 15:18:41+07:00
3   2020-06-09 16:18:41+07:00
4   2020-06-09 17:18:41+07:00
dtype: datetime64[ns, Asia/Jakarta]

In [30]:
s = s.dt.tz_convert('Australia/Hobart')
s.head()

0   2020-06-09 16:18:41+10:00
1   2020-06-09 17:18:41+10:00
2   2020-06-09 18:18:41+10:00
3   2020-06-09 19:18:41+10:00
4   2020-06-09 20:18:41+10:00
dtype: datetime64[ns, Australia/Hobart]